HRMREDChuklinTest.ZUPC/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="31b6e35b-6ac8-4bad-8581-be21e901c63b">
  <name>Сотрудники</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ZUPC_ActualDepartmentName</name>
    <type>
      <types>CatalogRef.ZUPC_ActualDepartmentName</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_Desk_Team</name>
    <type>
      <types>CatalogRef.ZUPC_Desk_Team</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_ActualPositionTitle</name>
    <type>
      <types>CatalogRef.ZUPC_ActualPositionTitle</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_Locations</name>
    <type>
      <types>CatalogRef.ZUPC_Locations</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата_net</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаПослеИспСрока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаЧерез6Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаЧерез9Мес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаЧерезГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HiringSalary</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаВОффере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерМеста</name>
    <type>
      <types>CatalogRef.ZUPC_НомерМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.ZUPC_Офисы</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0be23ee7-2744-4238-aae6-8cb1b220c38d">
    <name>ВАрхиве</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a95dc28b-b486-4280-b951-496927fc9f6f">
    <name>УточнениеНаименования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="90a6e696-4ebc-4edb-acbe-13ee9084a388">
    <name>ГоловнаяОрганизация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="56db42c8-34e7-466e-a3fe-c7a59ab68efa">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизоватьРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьАккаунт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропуск</name>
    <type>
      <types>CatalogRef.ZUPC_Пропуски</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйТелефон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Спеллинг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииHR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдаленнаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДМСЗаСвойСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_DateJoingGroup</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_Rosneft</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_RosneftDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_SignOnBonus</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_PerformanceBonusPerOffer</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_SignOnBonusNotificationSentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_NonEstablishedEmployees</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_RemoteWorkLocation</name>
    <type>
      <types>CatalogRef.ZUPC_RemoteWorkLocation</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_EmploymentInMultipleLocations</name>
    <type>
      <types>CatalogRef.ZUPC_EmploymentInMultipleLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_SalaryInOffer</name>
    <type>
      <types>EnumRef.ZUPC_SalaryInOffer</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_desk_missing</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ZUPC_DescriptionAccomodation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ZUPC_PerformanceBonusNotificationDates</name>
    <attributes>
      <name>NotificationDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2217d703-fd43-489d-8b41-3e2e97a48688">
    <name>УдалитьНаборыЗначенийДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

HRMREDChuklinTest.ZUPC/src/InformationRegisters/ВыполнениеРассылки/ВыполнениеРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеРассылки</name>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Измерение1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HRMREDChuklinTest.ZUPC/src/Catalogs/Сотрудники/ObjectModule.bsl
&После("ПриЗаписи")
Процедура ЦЗ_ПриЗаписи(Отказ)
	
	ВыпРас = РегистрыСведений.ВыполнениеРассылки.СоздатьМенеджерЗаписи();
	ВыпРас.Объект = Ссылка;
	ВыпРас.Прочитать();
	Если Не ЗначениеЗаполнено(ВыпРас.Объект) Тогда
		ВыпРас.Объект = Ссылка;
		ВыпРас.Записать();
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура ZUPC_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	Если ЭтоНовый() Тогда
		НепроверяемыеРеквизиты.Добавить("ZUPC_Locations");
	КонецЕсли;
	Если НепроверяемыеРеквизиты.Количество() > 0 Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры
